Compressible/NACA0012_CompressibleFlow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{	
    p
    {
	solver GAMG;
	tolerance 1e-06;
	relTol 0.01;
	smoother DICGaussSeidel;
	nPreSweeps 0;
	nPostSweeps 2;
	cacheAgglomeration on;
	agglomerator faceAreaPair;
	nCellsInCoarsestLevel 15;
	mergeLevels 1;
    }

    "(U|k|omega|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.01;
    }
   /*"(U|k|omega|e)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
   */
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    pMinFactor      0.1;
    pMaxFactor      2;

    residualControl
    {
        p               	    1e-6;
        U               	    1e-6;
        "(k|omega|e)"             1e-6;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
        rho             0.01;
    }
    equations
    {
        U               	     0.7;
        e                           0.7;
        "(k|omega)"                 0.7;
    }
}

// ************************************************************************* //
